Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: For 'Oxyfuel Cutting', the foundational principles remain relatively similar. However, a standout distinction emerges in the working pressures: oxygen consistently demands a higher pressure than acetylene, as recommended by manufacturers. For example: If in doubt, and you can't determine your cutting tip size, set your Oxygen working pressure to 20 - 25 psi and your Acetelyne pressure to 5 psi. This will help you determine which thickness of metal you may be able to properly cut with it. In essence, while oxyfuel welding might not be the trendiest technique today, its versatility and adaptability, especially in off-grid scenarios, make it an invaluable tool in the welder's arsenal. Proper adherence to safety and operational guidelines is pivotal, ensuring both quality work and a safe working environment.
es_419: Para el 'oxicombustible', los principios fundamentales siguen siendo relativamente similares. Sin embargo, surge una diferencia notable en las presiones de trabajo: el oxígeno exige constantemente una presión más alta que el acetileno, como recomiendan los fabricantes. Por ejemplo: en caso de duda y no puede determinar el tamaño de su punta de corte, establezca la presión de trabajo de oxígeno en 20 - 25 psi y la presión de acetelino en 5 psi. Esto te ayudará a determinar qué espesor de metal podrás cortar correctamente con él. En esencia, si bien la soldadura con oxicombustible puede no ser la técnica más moderna hoy en día, su versatilidad y adaptabilidad, especialmente en escenarios fuera de la red, la convierten en una herramienta invaluable en el arsenal del soldador. El cumplimiento adecuado de las pautas operativas y de seguridad es fundamental para garantizar un trabajo de calidad y un entorno de trabajo seguro.
fil_ph: Para sa 'Oxyfuel Cutting', ang mga pangunahing prinsipyo ay nananatiling medyo magkatulad. Gayunpaman, lumilitaw ang isang namumukod-tanging pagkakaiba sa mga gumaganang presyon: ang oxygen ay patuloy na nangangailangan ng mas mataas na presyon kaysa sa acetylene, gaya ng inirerekomenda ng mga tagagawa. Halimbawa: Kung may pagdududa, at hindi mo matukoy ang laki ng iyong cutting tip, itakda ang iyong Oxygen working pressure sa 20 - 25 psi at ang iyong Acetelyne pressure sa 5 psi. Makakatulong ito sa iyo na matukoy kung aling kapal ng metal ang maaari mong maayos na gupitin dito. Sa esensya, habang ang oxyfuel welding ay maaaring hindi ang pinaka-uso na pamamaraan ngayon, ang versatility at adaptability nito, lalo na sa mga off-grid na sitwasyon, ay ginagawa itong isang napakahalagang tool sa arsenal ng welder. Ang wastong pagsunod sa mga alituntunin sa kaligtasan at pagpapatakbo ay mahalaga, na tinitiyak ang parehong kalidad ng trabaho at isang ligtas na kapaligiran sa pagtatrabaho.
ht: Pou 'Koupe Oxyfuel', prensip fondamantal yo rete relativman menm jan an. Sepandan, yon diferans ki parèt nan presyon k ap travay yo: oksijèn toujou mande yon presyon ki pi wo pase asetilèn, jan manifaktirè yo rekòmande. Pa egzanp: Si gen dout, epi ou pa ka detèmine gwosè pwent koupe ou, mete presyon k ap travay Oksijèn ou a 20 - 25 psi ak presyon Acetelyne ou a 5 psi. Sa ap ede w detèmine ki epesè metal ou ka byen koupe ak li. Nan sans, pandan y ap soude oxyfuel pa ta ka teknik ki pi tandans jodi a, adaptabilite li yo ak adaptabilite, espesyalman nan senaryo off-grid, fè li yon zouti anpil valè nan asenal soude a. Aderans kòrèk ak direktiv sekirite ak operasyon yo se esansyèl, asire tou de bon jan kalite travay ak yon anviwònman travay ki an sekirite.
pt_br: Para o 'Corte de Oxicorte', os princípios fundamentais permanecem relativamente semelhantes. No entanto, surge uma distinção notável nas pressões de trabalho: o oxigénio exige consistentemente uma pressão mais elevada do que o acetileno, conforme recomendado pelos fabricantes. Por exemplo: em caso de dúvida e você não conseguir determinar o tamanho da ponta de corte, defina a pressão de trabalho do oxigênio para 20 - 25 psi e a pressão do Acetelyne para 5 psi. Isso o ajudará a determinar qual espessura de metal você poderá cortar adequadamente com ele. Em essência, embora a soldagem oxicorte possa não ser a técnica mais moderna atualmente, sua versatilidade e adaptabilidade, especialmente em cenários fora da rede, fazem dela uma ferramenta inestimável no arsenal do soldador. A adesão adequada às diretrizes operacionais e de segurança é fundamental, garantindo um trabalho de qualidade e um ambiente de trabalho seguro.
zh_hans: 对于“火焰切割”，基本原理仍然相对相似。然而，工作压力存在显着区别：正如制造商建议的那样，氧气始终需要比乙炔更高的压力。例如：如果有疑问，并且您无法确定切割尖端尺寸，请将氧气工作压力设​​置为 20 - 25 psi，将乙炔压力设置为 5 psi。这将帮助您确定可以用它正确切割的金属厚度。 从本质上讲，虽然氧燃料焊接可能不是当今最流行的技术，但其多功能性和适应性，特别是在离网情况下，使其成为焊工武器库中的宝贵工具。正确遵守安全和操作指南对于确保高质量的工作和安全的工作环境至关重要。

source: For instance, let's dissect the concept of 'transfer modes.' GMAW has multiple modes, including 'short circuit,' 'globular,' 'pulse,' and 'spray.' Distinguishing between them and setting your machine accurately for each mode is pivotal. In a generalized context, for a 0.035 wire size, material thickness of 1/4 inch, and a shielding gas mix of 75% argon and 25% CO2, the 'short circuit mode' is typically achieved with voltage settings ranging between 17-24 volts and wire speeds between 75-420 inches per minute. Transcending these settings, you would transition to the “spray mode”. But remember, shifting to this mode may necessitate a change in the gas blend to elevate the arc's energy. Each transfer mode offers unique advantages. The 'short circuit mode,' for instance, is preferred for welding out of position or when addressing larger gaps in imperfectly aligned joints. However, it has its limitations, especially when ensuring thorough fusion in pressurized vessels or pipes. In contrast, the "spray transfer mode" is revered for its guarantee of optimal fusion, making it ideal for code-quality welding. Its primary limitation? It's primarily restricted to flat and horizontal position welding and demands significant expertise for managing large gaps. Selecting the appropriate wire size is another pivotal aspect of GMAW. While 0.035 wire size is versatile enough for materials ranging between 1/8” to ½”, for thicker materials (½” and above), the .045 wire is preferable. On the other end of the spectrum, working with sheet metal necessitates switching to .023-.030 sized wires.
es_419: Por ejemplo, analicemos el concepto de "modos de transferencia". GMAW tiene múltiples modos, incluidos "cortocircuito", "globular", "pulso" y "pulverización". Es fundamental distinguir entre ellos y configurar su máquina con precisión para cada modo. En un contexto generalizado, para un tamaño de cable de 0,035, un espesor de material de 1/4 de pulgada y una mezcla de gas protector de 75 % de argón y 25 % de CO2, el "modo de cortocircuito" generalmente se logra con ajustes de voltaje que oscilan entre 17 y 24 voltios y velocidades de cable entre 75 y 420 pulgadas por minuto. Más allá de estas configuraciones, pasará al "modo de pulverización". Pero recuerde, cambiar a este modo puede requerir un cambio en la mezcla de gases para elevar la energía del arco. Cada modo de transferencia ofrece ventajas únicas. El 'modo de cortocircuito', por ejemplo, se prefiere para soldar fuera de posición o cuando se tratan espacios más grandes en uniones imperfectamente alineadas. Sin embargo, tiene sus limitaciones, especialmente cuando se trata de garantizar una fusión completa en recipientes o tuberías presurizados. Por el contrario, el "modo de transferencia por pulverización" es venerado por su garantía de fusión óptima, lo que lo hace ideal para soldadura con calidad de código. ¿Su principal limitación? Se limita principalmente a la soldadura en posición plana y horizontal y exige una gran experiencia para gestionar grandes espacios. Seleccionar el tamaño de cable apropiado es otro aspecto fundamental de GMAW. Si bien el tamaño de alambre de 0,035 es lo suficientemente versátil para materiales que varían entre 1/8” y ½”, para materiales más gruesos (½” y superiores), es preferible el alambre de 0,045. En el otro extremo del espectro, trabajar con chapa metálica requiere cambiar a cables de tamaño 0,023-0,030.
fil_ph: Halimbawa, hatiin natin ang konsepto ng 'mga mode ng paglilipat.' Ang GMAW ay may maraming mga mode, kabilang ang 'short circuit,' 'globular,' 'pulse,' at 'spray.' Ang pagkakaiba sa pagitan ng mga ito at ang tamang pagtatakda ng iyong makina para sa bawat mode ay mahalaga. Sa pangkalahatang konteksto, para sa 0.035 na laki ng wire, 1/4 inch ang kapal ng materyal, at isang shielding gas mix na 75% argon at 25% CO2, ang 'short circuit mode' ay karaniwang nakakamit sa mga setting ng boltahe na nasa pagitan ng 17-24 volts at wire na bilis sa pagitan ng 75-420 pulgada kada minuto. Paglampas sa mga setting na ito, lilipat ka sa "spray mode". Ngunit tandaan, ang paglipat sa mode na ito ay maaaring mangailangan ng pagbabago sa timpla ng gas upang mapataas ang enerhiya ng arko. Nag-aalok ang bawat mode ng paglipat ng mga natatanging pakinabang. Ang 'short circuit mode,' halimbawa, ay ginustong para sa pag-welding sa labas ng posisyon o kapag tinutugunan ang mas malalaking puwang sa hindi perpektong nakahanay na mga joint. Gayunpaman, mayroon itong mga limitasyon, lalo na kapag tinitiyak ang masusing pagsasanib sa mga may pressure na sisidlan o tubo. Sa kaibahan, ang "spray transfer mode" ay iginagalang para sa garantiya ng pinakamainam na pagsasanib, na ginagawa itong perpekto para sa kalidad ng code na hinang. Ang pangunahing limitasyon nito? Pangunahing pinaghihigpitan ito sa flat at horizontal position welding at nangangailangan ng makabuluhang kadalubhasaan para sa pamamahala ng malalaking gaps. Ang pagpili ng naaangkop na laki ng wire ay isa pang mahalagang aspeto ng GMAW. Habang ang 0.035 na laki ng wire ay sapat na versatile para sa mga materyales na nasa pagitan ng 1/8" hanggang ½", para sa mas makapal na materyales (½" at pataas), ang .045 wire ay mas gusto. Sa kabilang dulo ng spectrum, ang pagtatrabaho sa sheet metal ay nangangailangan ng paglipat sa .023-.030 na laki ng mga wire.
ht: Pou egzanp, ann diseke konsèp nan 'mòd transfè.' GMAW gen plizyè mòd, tankou 'kout sikwi', 'globular', 'batman kè' ak 'espre'. Distenksyon ant yo ak mete machin ou avèk presizyon pou chak mòd se esansyèl. Nan yon kontèks jeneralize, pou yon gwosè fil 0.035, epesè materyèl nan 1/4 pous, ak yon melanj gaz pwoteksyon nan 75% agon ak 25% CO2, 'mòd sikwi kout la' anjeneral reyalize ak anviwònman vòltaj ki varye ant 17-24. vòlt ak vitès fil ant 75-420 pous pou chak minit. Depase anviwònman sa yo, ou ta tranzisyon nan "mòd espre". Men, sonje, chanjman nan mòd sa a ka bezwen yon chanjman nan melanj gaz la elve enèji arc la. Chak mòd transfè ofri avantaj inik. 'Mòd kous kout la', pou egzanp, pi pito pou soude soti nan pozisyon oswa lè adrese pi gwo twou vid ki genyen nan jwenti ki pa pafè. Sepandan, li gen limit li yo, espesyalman lè asire bon jan fizyon nan veso presyon oswa tiyo. Nan kontras, "mòd transfè espre" venere pou garanti li yo nan fizyon pi bon, ki fè li ideyal pou kòd-bon jan kalite soude. Limit prensipal li? Li prensipalman limite a soude pozisyon plat ak orizontal epi li mande ekspètiz enpòtan pou jere gwo twou vid ki genyen. Chwazi gwosè fil ki apwopriye a se yon lòt aspè esansyèl nan GMAW. Pandan ke gwosè fil 0.035 se versatile ase pou materyèl ki varye ant 1/8 "a ½", pou materyèl ki pi epè (½" ak pi wo a), fil .045 la pi preferab. Nan lòt bout nan spectre a, travay ak metal fèy nesesite chanje nan .023-.030 fil gwosè.
pt_br: Por exemplo, vamos dissecar o conceito de “modos de transferência”. GMAW tem vários modos, incluindo 'curto-circuito', 'globular', 'pulso' e 'spray'. Distinguir entre eles e configurar sua máquina com precisão para cada modo é fundamental. Em um contexto generalizado, para um tamanho de fio 0,035, espessura de material de 1/4 de polegada e uma mistura de gás de proteção de 75% de argônio e 25% de CO2, o 'modo de curto-circuito' é normalmente alcançado com configurações de tensão variando entre 17-24 volts e velocidades de fio entre 75-420 polegadas por minuto. Transcendendo essas configurações, você faria a transição para o “modo spray”. Mas lembre-se, mudar para este modo pode exigir uma mudança na mistura de gases para elevar a energia do arco. Cada modo de transferência oferece vantagens exclusivas. O 'modo de curto-circuito', por exemplo, é preferido para soldagem fora de posição ou quando se trata de folgas maiores em juntas mal alinhadas. No entanto, tem as suas limitações, especialmente quando se assegura uma fusão completa em vasos ou tubos pressurizados. Em contraste, o “modo de transferência por spray” é reverenciado por sua garantia de fusão ideal, tornando-o ideal para soldagem com qualidade de código. Sua principal limitação? É restrito principalmente à soldagem em posições planas e horizontais e exige experiência significativa para gerenciar grandes lacunas. A seleção do tamanho de fio apropriado é outro aspecto fundamental do GMAW. Embora o tamanho do fio 0,035 seja versátil o suficiente para materiais que variam entre 1/8” a ½”, para materiais mais grossos (½” e acima), o fio .045 é preferível. No outro extremo do espectro, trabalhar com chapas metálicas exige a mudança para fios de tamanho 0,023-0,030.
zh_hans: 例如，让我们剖析“传输模式”的概念。 GMAW 有多种模式，包括“短路”、“球状”、“脉冲”和“喷雾”。区分它们并为每种模式准确设置机器至关重要。在一般情况下，对于 0.035 线径、1/4 英寸材料厚度以及 75% 氩气和 25% CO2 的保护气体混合物，“短路模式”通常通过 17-24 之间的电压设置来实现电压和线速在每分钟 75-420 英寸之间。超越这些设置，您将过渡到“喷雾模式”。但请记住，切换到这种模式可能需要改变气体混合物以提高电弧能量。 每种传输模式都具有独特的优势。例如，“短路模式”适用于错位焊接或解决未对齐接头中较大间隙的情况。然而，它也有其局限性，特别是在确保加压容器或管道中的彻底熔合时。相比之下，“喷涂传输模式”因其保证最佳熔合而受到推崇，使其成为代码质量焊接的理想选择。它的主要限制是什么？它主要限于平焊和水平位置焊接，并且需要大量的专业知识来管理大间隙。 选择合适的焊丝尺寸是 GMAW 的另一个关键方面。虽然 0.035 线径对于 1/8” 至 1/2” 范围内的材料来说足够通用，但对于较厚的材料（1/2” 及以上），0.045 线更可取。另一方面，使用金属板需要改用 0.023-0.030 尺寸的电线。

source: In the context of welding and metallurgy, "ductility" denotes a material's ability to deform plastically without breaking or fracturing when subjected to tensile stress. Essentially, it measures how much a material can be stretched, bent, or otherwise deformed before reaching its breaking point. Ductile materials can absorb significant energy and undergo considerable deformation before failing, making them particularly valuable in applications where toughness and resilience are paramount. Ductility is a crucial property to consider in welding because weld joints often need to maintain their structural integrity under varying stress conditions. When metals with high ductility are welded, they are less likely to crack or break at the weld seam or in the heat-affected zone, even when subjected to force or bending. Moreover, during the welding process, rapid heating and cooling can cause structural changes in the metals. Materials with good ductility tend to accommodate these changes better, reducing the risk of weld defects like cracking or brittleness. To quantify ductility, one can use measures like elongation and reduction of area obtained from tensile tests. A material that exhibits a significant degree of elongation before rupture is considered to have high ductility. In welding, understanding the ductility of the metals involved helps in selecting the appropriate welding process, filler metals, and post-weld treatments, ensuring the production of strong, durable, and flexible weld joints suitable for their intended applications.
es_419: En el contexto de la soldadura y la metalurgia, "ductilidad" denota la capacidad de un material para deformarse plásticamente sin romperse o fracturarse cuando se somete a una tensión de tracción. Básicamente, mide cuánto se puede estirar, doblar o deformar un material antes de alcanzar su punto de rotura. Los materiales dúctiles pueden absorber una cantidad significativa de energía y sufrir una deformación considerable antes de fallar, lo que los hace particularmente valiosos en aplicaciones donde la tenacidad y la resiliencia son primordiales. La ductilidad es una propiedad crucial a considerar en la soldadura porque las uniones soldadas a menudo necesitan mantener su integridad estructural bajo diferentes condiciones de tensión. Cuando se sueldan metales con alta ductilidad, es menos probable que se agrieten o rompan en la costura de soldadura o en la zona afectada por el calor, incluso cuando se someten a fuerza o flexión. Además, durante el proceso de soldadura, el calentamiento y enfriamiento rápidos pueden provocar cambios estructurales en los metales. Los materiales con buena ductilidad tienden a adaptarse mejor a estos cambios, lo que reduce el riesgo de defectos de soldadura como grietas o fragilidad. Para cuantificar la ductilidad, se pueden utilizar medidas como el alargamiento y la reducción del área obtenidas de ensayos de tracción. Se considera que un material que exhibe un grado significativo de alargamiento antes de la ruptura tiene alta ductilidad. En soldadura, comprender la ductilidad de los metales involucrados ayuda a seleccionar el proceso de soldadura, los metales de aportación y los tratamientos posteriores a la soldadura adecuados, lo que garantiza la producción de uniones soldadas fuertes, duraderas y flexibles adecuadas para las aplicaciones previstas.
fil_ph: Sa konteksto ng welding at metalurhiya, ang "ductility" ay tumutukoy sa kakayahan ng isang materyal na mag-deform ng plastic nang hindi masira o mabali kapag napapailalim sa tensile stress. Sa esensya, sinusukat nito kung gaano kalaki ang isang materyal na maaaring iunat, baluktot, o kung hindi man ay deformed bago maabot ang breaking point nito. Ang mga ductile na materyales ay maaaring sumipsip ng malaking enerhiya at sumasailalim sa malaking pagpapapangit bago mabigo, na ginagawang partikular na mahalaga sa mga aplikasyon kung saan ang katigasan at katatagan ay pinakamahalaga. Ang ductility ay isang mahalagang pag-aari na dapat isaalang-alang sa welding dahil ang mga weld joint ay kadalasang kailangang mapanatili ang kanilang integridad sa istruktura sa ilalim ng iba't ibang mga kondisyon ng stress. Kapag ang mga metal na may mataas na ductility ay hinangin, mas malamang na sila ay pumutok o masira sa weld seam o sa lugar na apektado ng init, kahit na sumailalim sa puwersa o baluktot. Bukod dito, sa panahon ng proseso ng hinang, ang mabilis na pag-init at paglamig ay maaaring maging sanhi ng mga pagbabago sa istruktura sa mga metal. Ang mga materyal na may mahusay na ductility ay may posibilidad na tumanggap ng mga pagbabagong ito nang mas mahusay, na binabawasan ang panganib ng mga depekto sa weld tulad ng pag-crack o brittleness. Upang mabilang ang ductility, maaaring gumamit ng mga hakbang tulad ng pagpahaba at pagbabawas ng lugar na nakuha mula sa mga tensile test. Ang isang materyal na nagpapakita ng isang makabuluhang antas ng pagpahaba bago pumutok ay itinuturing na may mataas na ductility. Sa welding, ang pag-unawa sa ductility ng mga metal na kasangkot ay nakakatulong sa pagpili ng naaangkop na proseso ng welding, filler metals, at post-weld treatments, na tinitiyak ang paggawa ng malakas, matibay, at nababaluktot na weld joints na angkop para sa kanilang nilalayon na aplikasyon.
ht: Nan yon kontèks soude ak metaliji, "duktilite" vle di kapasite yon materyèl pou defòme plastik san yo pa kraze oswa fraktire lè yo sibi estrès tansyon. Esansyèlman, li mezire konbyen yon materyèl ka lonje, koube, oswa otreman defòme anvan yo rive nan pwen kraze li yo. Materyèl duktil ka absòbe enèji enpòtan epi sibi deformation konsiderab anvan yo echwe, sa ki fè yo patikilyèman valab nan aplikasyon kote severite ak rezistans yo esansyèl. Duktilite se yon pwopriyete enpòtan pou konsidere nan soude paske jwenti soude souvan bezwen kenbe entegrite estriktirèl yo anba kondisyon estrès varye. Lè metal ki gen gwo duktilite yo soude, yo gen mwens chans krak oswa kraze nan kouti a soude oswa nan zòn ki afekte chalè a, menm lè yo sibi fòs oswa koube. Anplis, pandan pwosesis la soude, rapid chofaj ak refwadisman ka lakòz chanjman estriktirèl nan metal yo. Materyèl ki gen bon duktilite yo gen tandans akomode chanjman sa yo pi byen, diminye risk pou yo domaj soude tankou fann oswa frajil. Pou mezire duktilite, yon moun ka itilize mezi tankou elongasyon ak rediksyon nan zòn yo jwenn nan tès tensile. Yon materyèl ki montre yon degre siyifikatif elongasyon anvan rupture konsidere kòm gen gwo duktilite. Nan soude, konpreyansyon duktilite metal yo enplike nan ede nan chwazi pwosesis la soude ki apwopriye, metal ranpli, ak tretman apre-soude, asire pwodiksyon an nan jwenti soude fò, dirab, ak fleksib apwopriye pou aplikasyon yo gen entansyon.
pt_br: No contexto da soldagem e da metalurgia, "ductilidade" denota a capacidade de um material de se deformar plasticamente sem quebrar ou fraturar quando submetido a tensões de tração. Essencialmente, mede o quanto um material pode ser esticado, dobrado ou deformado antes de atingir seu ponto de ruptura. Os materiais dúcteis podem absorver energia significativa e sofrer deformações consideráveis ​​antes de falharem, tornando-os particularmente valiosos em aplicações onde a tenacidade e a resiliência são fundamentais. A ductilidade é uma propriedade crucial a ser considerada na soldagem porque as juntas soldadas geralmente precisam manter sua integridade estrutural sob condições de tensão variadas. Quando metais com alta ductilidade são soldados, eles são menos propensos a rachar ou quebrar na costura de solda ou na zona afetada pelo calor, mesmo quando submetidos a força ou flexão. Além disso, durante o processo de soldagem, o aquecimento e o resfriamento rápidos podem causar alterações estruturais nos metais. Materiais com boa ductilidade tendem a acomodar melhor essas mudanças, reduzindo o risco de defeitos de solda como rachaduras ou fragilidade. Para quantificar a ductilidade, pode-se utilizar medidas como alongamento e redução de área obtidas em ensaios de tração. Um material que apresenta um grau significativo de alongamento antes da ruptura é considerado de alta ductilidade. Na soldagem, compreender a ductilidade dos metais envolvidos ajuda na seleção do processo de soldagem, dos metais de adição e dos tratamentos pós-soldagem apropriados, garantindo a produção de juntas de solda fortes, duráveis ​​e flexíveis, adequadas às aplicações pretendidas.
zh_hans: 在焊接和冶金领域，“延展性”表示材料在受到拉伸应力时塑性变形而不破裂或断裂的能力。本质上，它测量材料在达到断裂点之前可以拉伸、弯曲或以其他方式变形的程度。延展性材料可以吸收大量能量并在失效前经历相当大的变形，这使得它们在韧性和弹性至关重要的应用中特别有价值。 延展性是焊接中需要考虑的一个重要特性，因为焊缝通常需要在不同的应力条件下保持其结构完整性。当焊接具有高延展性的金属时，即使受到外力或弯曲，它们也不太可能在焊缝或热影响区破裂或断裂。此外，在焊接过程中，快速加热和冷却会导致金属的结构变化。具有良好延展性的材料往往能更好地适应这些变化，从而降低出现裂纹或脆性等焊接缺陷的风险。 为了量化延展性，可以使用拉伸测试中获得的伸长率和面积减少等指标。在断裂前表现出显着伸长率的材料被认为具有高延展性。在焊接中，了解所涉及金属的延展性有助于选择适当的焊接工艺、填充金属和焊后处理，确保生产出适合其预期应用的坚固、耐用且灵活的焊接接头。
